'use client';

import {
  FaVideo,
  FaInstagram,
  FaComments,
  FaUsers,
  FaQuestionCircle,
  FaClipboardCheck,
} from 'react-icons/fa';

import { TabKey } from '../types';

export const tabs: {
  id: TabKey;
  translationKey: string;
  icon: React.ElementType;
}[] = [
  {
    id: 'post',
    translationKey: 'social_media_post_reel',
    icon: FaVideo,
  },
  {
    id: 'story',
    translationKey: 'social_media_story',
    icon: FaInstagram,
  },
  {
    id: 'groupMessage',
    translationKey: 'group_messages',
    icon: FaUsers,
  },
  {
    id: 'direct',
    translationKey: 'direct_messages',
    icon: FaComments,
  },
  {
    id: 'guid',
    translationKey: 'guidance_for_questions',
    icon: FaQuestionCircle,
  },
  {
    id: 'followUp',
    translationKey: 'follow_up_messages',
    icon: FaClipboardCheck,
  },
];

export const toneOptions = [
  {
    value: 0,
    label: 'دوستانه',
  },
  {
    value: 1,
    label: 'رسمی',
  },
  {
    value: 2,
    label: 'هیجانی',
  },
];

export const focusOptions = [
  {
    value: 0,
    label: 'عمومی',
  },
  {
    value: 1,
    label: 'ایمپلنت',
  },
  {
    value: 2,
    label: 'کامپوزیت و زیبایی',
  },
  {
    value: 3,
    label: 'لمینت',
  },
  {
    value: 4,
    label: 'ارتودنسی',
  },
  {
    value: 5,
    label: 'عصب‌کشی (اندو)',
  },
  {
    value: 6,
    label: 'اطفال',
  },
  {
    value: 7,
    label: 'جراحی لثه',
  },
  {
    value: 8,
    label: 'بلیچینگ',
  },
];

export const medias = [
  {
    id: 1,
    title: '«وام ۱۵۰ میلیونی» ویژه خدمات دندانپزشکی',
    src: '/assets/dental-plane/ویژه-خدمات-دندانپزشکی.jpg',
    fileName: 'ویژه-خدمات-دندانپزشکی.jpg',
    downloadText: 'دانلود تصویر',
    isVideo: false,
  },
  {
    id: 2,
    title: 'با اقساط ۱۲ ماهه در سامانه «دنتالیت»',
    src: '/assets/dental-plane/اقساط.jpg',
    fileName: 'اقساط.jpg',
    downloadText: 'دانلود تصویر',
    isVideo: false,
  },
  {
    id: 3,
    title: 'با «وام ۱۵۰ میلیونی» دنتالیت در سراسر ایران',
    src: '/assets/dental-plane/وام.jpg',
    fileName: 'وام.jpg',
    downloadText: 'دانلود تصویر',
    isVideo: false,
  },
  {
    id: 4,
    title: 'بنر «معرفی وام ۱۵۰ میلیونی»',
    src: '/assets/dental-plane/artboard.jpg',
    fileName: 'banner.jpg',
    downloadText: 'دانلود تصویر',
    isVideo: false,
  },
  {
    id: 5,
    title: 'بنر « درمان بدون پیش پرداخت »',
    src: '/assets/dental-plane/_استند رو میزی.jpg',
    fileName: '_استند رو میزی.jpg',
    downloadText: 'دانلود تصویر',
    isVideo: false,
  },
  {
    id: 6,
    title: ' « معرفی دنتالیت به بیماران»',
    src: '/assets/video/نحوه-استفاده-بیمار-از-سامانه.mp4',
    fileName: 'education.mp4',
    downloadText: 'دانلود ویدیو',
    isVideo: true,
  },
];

export const directMessages = [
  {
    id: 1,
    question: 'سوال بیمار: "سقف این اعتبار چقدره و آیا ضامن میخواد؟"',
    answer:
      'سلام وقت بخیر 🌸 سقف این اعتبار تا ۱۵۰ میلیون تومانه. خبر خوب اینه که کل فرآیند اعتبارسنجی و اخذ اعتبار آنلاینه. وثیقه اصلی سفته و چک الکترونیک هست و معرفی ضامن هم بستگی به رتبه اعتباری شما در بانک مرکزی داره.',
  },
  {
    id: 2,
    question: 'سوال بیمار: "مراحلش چطوریه؟ از کجا باید شروع کنم؟"',
    answer: `سلام عزیزم ✨ مراحلش خیلی سادست:
  ۱. اول اپلیکیشن «باجت» (متعلق به بانک تجارت) رو نصب کن.
  ۲. وارد بخش «طب نو» بشو و درخواست اعتبار دنتالیت رو ثبت کن.
  ۳. بعد از دریافت اعتبار به مرکز ما مراجعه کن تا درمانت رو بی‌دردسر شروع کنیم 🦷`,
  },
  {
    id: 3,
    question: 'سوال بیمار: "سود اقساط و مدت زمان بازپرداختش چقدره؟"',
    answer:
      'سلام 🌷 هزینه‌های شما ۱۲ ماهه قسط‌بندی می شه. برای محاسبه دقیق اقساط و سودش، میتونی اپلیکیشن باجت رو نصب کنی تا مبالغ رو دقیق بهت نشون بده.',
  },
  {
    id: 4,
    question: 'سوال بیمار: "آیا میشه این اعتبار رو نقد کرد یا تو کارتم بریزم؟"',
    answer:
      'وقتتون بخیر 🌸 نه متاسفانه، این اعتبار قابل برداشت نقدی نیست و منحصراً برای پرداخت هزینه‌های خدمات دندانپزشکی در مراکز طرف قرارداد (مثل مرکز ما) طراحی شده.',
  },
  {
    id: 5,
    question:
      'سوال بیمار: "می‌تونم با اعتباری که گرفتم، هزینه دندونپزشکی همسرم/فرزندم رو بدم؟"',
    answer:
      'سلام عزیزم ✨ بله حتما! در صورتی که خود شما به عنوان گیرنده وام تایید کنید، هیچ مشکلی نیست و می‌تونید موجودی کیف پول دنتالیت خودتون رو برای هزینه‌های درمانی سایر اعضای خانواده تو مرکز ما استفاده کنید.',
  },
  {
    id: 6,
    question: 'سوال بیمار: "شرایط اعتبارسنجی چیه؟ به کیا وام نمیدن؟"',
    answer:
      'وقت بخیر 🌷 تو مرحله اعتبارسنجی، رفتار مالی بانکی شما بررسی میشه. یعنی اگر اقساط معوقه بانکی یا چک برگشتی نداشته باشید، می‌تونید به راحتی این اعتبار رو دریافت کنید. این طرح برای همه افراد بالای ۱۸ سال که حساب بانکی فعال دارند قابل استفاده است.',
  },
  {
    id: 7,
    question: 'سوال بیمار: "اقساط رو ماهانه چطوری و کجا باید واریز کنیم؟"',
    answer:
      'سلام 🌸 بازپرداخت خیلی راحته. امکان پرداخت اقساط از طریق درگاه اینترنتی با تمامی کارت‌های بانکی دارای رمز پویا در اپلیکیشن باجت فراهم شده.',
  },
];

export const smsMessages = [
  {
    id: 1,
    title: 'گروه خانوادگی / فامیل',
    text: `سلام به همه عزیزان 🌸
یه خبر خوب برای کسایی که کار دندانپزشکی (ایمپلنت، کامپوزیت یا ارتودنسی) دارن ولی به خاطر هزینه‌ها عقب انداختن. سامانه «دنتالیت» با همکاری بانک تجارت یه طرح ملی گذاشته که تا ۱۵۰ میلیون تومن اعتبار دندانپزشکی میده اونم با اقساط ۱۲ ماهه.
فرآیندش کاملا آنلاینه. من تو باشگاه معرفین دنتالیت عضو هستم و می‌تونم ثبت‌نام اولیه شما رو تو سامانه انجام بدم تا راحت‌تر وارد طرح بشید.
هرکس نیاز داره بهم پیام بده و شماره موبایلش رو بفرسته تا براش تو سامانه دنتالیت ثبت کنم و راهنماییش کنم. 🦷✨`,
    titleClass: 'text-violet-700',
    bgClass: 'bg-violet-100',
  },
  {
    id: 2,
    title: 'گروه همکاران / اداره',
    text: `همکاران گرامی وقت بخیر 🙏
اگر کسی از شما یا اعضای خانواده‌تون نیاز به خدمات دندانپزشکی داره ولی دنبال شرایط اقساطی هستید، یه طرح خیلی خوب به اسم «طب نو» توسط بانک تجارت و سامانه دنتالیت اجرا شده.
این طرح تا سقف ۱۵۰ میلیون تومان اعتبار ۱۲ ماهه میده و کل مراحلش هم آنلاینه (اپلیکیشن باجت).
من می‌تونم شمارتون رو به عنوان متقاضی تو سامانه دنتالیت ثبت کنم تا مسیر ورودتون به این طرح سریع‌تر انجام بشه. اگر تمایل داشتید شمارتون رو پی‌وی برام بفرستید. 🌷`,
    titleClass: 'text-(--primary)',
    bgClass: 'bg-blue-100',
  },
  {
    id: 3,
    title: 'پیام شخصی (به دوست صمیمی)',
    text: `سلام خوبی؟ یادمه چند وقت پیش میگفتی باید دندوناتو درست کنی ولی هزینش خیلی بالاست.
الان یه طرحی اومده از طرف بانک تجارت و سامانه دنتالیت که تا ۱۵۰ میلیون اعتبار دندانپزشکی میده (بازپرداخت ۱۲ ماهه و بدون نیاز به پیش‌پرداخت تو مطب).
من یه ظرفیت محدود (کلا ۲۰ نفر) دارم که میتونم دوستامو تو سامانه دنتالیت ثبت‌نام کنم تا راحت‌تر بتونن از این تسهیلات استفاده کنن. خواستی بگو شماره موبایلت رو ثبت کنم حیف نشه این فرصت!`,
    titleClass: 'text-[#15803d]',
    bgClass: 'bg-[#dcfce7]',
  },
];