export const guidData = [
  {
    id: 1,
    step: 'مرحله اول',
    image: '/assets/dental-plane/1.jpg',
    title: 'انتخاب وام کالانو',
    text: (
      <>
        وارد اپلیکیشن باجت شوید و در صفحه اصلی <strong>(بخش «بگیر»)</strong>،
        گزینه وام کالانو را انتخاب کنید.
      </>
    ),
  },
  {
    id: 2,
    step: 'مرحله دوم',
    image: '/assets/dental-plane/2.jpg',
    title: 'شروع درخواست اعتبار',
    text: (
      <>
        پس از مشاهده مزایای طرح (بدون نیاز به مراجعه حضوری و ضمانت سفته
        الکترونیک)، روی دکمه <strong>درخواست اعتبار</strong> بزنید.
      </>
    ),
  },
  {
    id: 3,
    step: 'مرحله سوم',
    image: '/assets/dental-plane/3.jpg',
    title: 'انتخاب دسته سلامت و درمان',
    text: (
      <>
        از میان فهرست دسته‌بندی‌ها، گزینه <strong>سلامت و درمان</strong> (دریافت
        اعتبار تا سقف ۱۵۰ میلیون تومان) را انتخاب کنید.
      </>
    ),
  },
  {
    id: 4,
    step: 'مرحله چهارم',
    image: '/assets/dental-plane/4.jpg',
    title: 'انتخاب دنتالیت',
    text: (
      <>
        در میان ارائه‌دهندگان خدمات درمانی، نشان تجاری <strong>دنتالیت</strong>{' '}
        را انتخاب نمایید.
      </>
    ),
  },
  {
    id: 5,
    step: 'مرحله پنجم',
    image: '/assets/dental-plane/5.jpg',
    title: 'ثبت نهایی درخواست تسهیلات',
    text: (
      <>
        سقف اعتبار ۱۵۰ میلیون تومانی دنتالیت را تایید کرده و دکمه{' '}
        <strong>درخواست اعتبار</strong> را لمس کنید تا فرآیند اعتبارسنجی آنلاین
        آغاز شود.
      </>
    ),
  },
];